; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 7556)
	(= (fuel plane1) 1835)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city9)
	(= (capacity plane2) 14935)
	(= (fuel plane2) 1846)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 12)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at plane3 city6)
	(= (capacity plane3) 6455)
	(= (fuel plane3) 2112)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 9)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 4)
	(at plane4 city9)
	(= (capacity plane4) 2463)
	(= (fuel plane4) 363)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 2)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 1)
	(at plane5 city5)
	(= (capacity plane5) 8410)
	(= (fuel plane5) 1104)
	(= (slow-burn plane5) 4)
	(= (fast-burn plane5) 9)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 2)
	(at person1 city6)
	(at person2 city7)
	(at person3 city1)
	(at person4 city1)
	(at person5 city6)
	(at person6 city6)
	(at person7 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 603)
	(= (distance city0 city2) 849)
	(= (distance city0 city3) 601)
	(= (distance city0 city4) 679)
	(= (distance city0 city5) 942)
	(= (distance city0 city6) 731)
	(= (distance city0 city7) 861)
	(= (distance city0 city8) 814)
	(= (distance city0 city9) 860)
	(= (distance city1 city0) 603)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 865)
	(= (distance city1 city3) 527)
	(= (distance city1 city4) 961)
	(= (distance city1 city5) 537)
	(= (distance city1 city6) 964)
	(= (distance city1 city7) 942)
	(= (distance city1 city8) 545)
	(= (distance city1 city9) 544)
	(= (distance city2 city0) 849)
	(= (distance city2 city1) 865)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 665)
	(= (distance city2 city4) 842)
	(= (distance city2 city5) 951)
	(= (distance city2 city6) 547)
	(= (distance city2 city7) 837)
	(= (distance city2 city8) 630)
	(= (distance city2 city9) 636)
	(= (distance city3 city0) 601)
	(= (distance city3 city1) 527)
	(= (distance city3 city2) 665)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 995)
	(= (distance city3 city5) 618)
	(= (distance city3 city6) 654)
	(= (distance city3 city7) 835)
	(= (distance city3 city8) 870)
	(= (distance city3 city9) 614)
	(= (distance city4 city0) 679)
	(= (distance city4 city1) 961)
	(= (distance city4 city2) 842)
	(= (distance city4 city3) 995)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 969)
	(= (distance city4 city6) 974)
	(= (distance city4 city7) 964)
	(= (distance city4 city8) 570)
	(= (distance city4 city9) 653)
	(= (distance city5 city0) 942)
	(= (distance city5 city1) 537)
	(= (distance city5 city2) 951)
	(= (distance city5 city3) 618)
	(= (distance city5 city4) 969)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 906)
	(= (distance city5 city7) 802)
	(= (distance city5 city8) 514)
	(= (distance city5 city9) 721)
	(= (distance city6 city0) 731)
	(= (distance city6 city1) 964)
	(= (distance city6 city2) 547)
	(= (distance city6 city3) 654)
	(= (distance city6 city4) 974)
	(= (distance city6 city5) 906)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 662)
	(= (distance city6 city8) 880)
	(= (distance city6 city9) 748)
	(= (distance city7 city0) 861)
	(= (distance city7 city1) 942)
	(= (distance city7 city2) 837)
	(= (distance city7 city3) 835)
	(= (distance city7 city4) 964)
	(= (distance city7 city5) 802)
	(= (distance city7 city6) 662)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 624)
	(= (distance city7 city9) 917)
	(= (distance city8 city0) 814)
	(= (distance city8 city1) 545)
	(= (distance city8 city2) 630)
	(= (distance city8 city3) 870)
	(= (distance city8 city4) 570)
	(= (distance city8 city5) 514)
	(= (distance city8 city6) 880)
	(= (distance city8 city7) 624)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 712)
	(= (distance city9 city0) 860)
	(= (distance city9 city1) 544)
	(= (distance city9 city2) 636)
	(= (distance city9 city3) 614)
	(= (distance city9 city4) 653)
	(= (distance city9 city5) 721)
	(= (distance city9 city6) 748)
	(= (distance city9 city7) 917)
	(= (distance city9 city8) 712)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city3)
	(at person3 city6)
	(at person4 city4)
	(at person5 city8)
	(at person6 city0)
	(at person7 city3)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane3 city6)
   changed: (fuel plane3) from 2112 to 6455
   goals met: 0 of 7
2. (board person1 plane3 city6)
   deleted: (at person1 city6)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 7
3. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 7
4. (refuel plane1 city1)
   changed: (fuel plane1) from 1835 to 7556
   goals met: 0 of 7
5. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 7
6. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 0 to 2883, (fuel plane1) from 7556 to 4673
   goals met: 0 of 7
7. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 7
8. (fly plane1 city4 city6)
   deleted: (at plane1 city4)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 2883 to 5805, (fuel plane1) from 4673 to 1751
   goals met: 1 of 7
9. (debark person3 plane1 city6)
   deleted: (in person3 plane1)
   added: (at person3 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 7
10. (board person5 plane3 city6)
   deleted: (at person5 city6)
   added: (in person5 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 2 of 7
11. (board person6 plane3 city6)
   deleted: (at person6 city6)
   added: (in person6 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 2 of 7
12. (fly plane3 city6 city0)
   deleted: (at plane3 city6)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 5805 to 7998, (fuel plane3) from 6455 to 4262
   goals met: 2 of 7
13. (debark person1 plane3 city0)
   deleted: (in person1 plane3)
   added: (at person1 city0)
   changed: (onboard plane3) from 3 to 2
   goals met: 3 of 7
14. (debark person6 plane3 city0)
   deleted: (in person6 plane3)
   added: (at person6 city0)
   changed: (onboard plane3) from 2 to 1
   goals met: 4 of 7
15. (fly plane3 city0 city7)
   deleted: (at plane3 city0)
   added: (at plane3 city7)
   changed: (total-fuel-used) from 7998 to 10581, (fuel plane3) from 4262 to 1679
   goals met: 4 of 7
16. (board person2 plane3 city7)
   deleted: (at person2 city7)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 4 of 7
17. (board person7 plane3 city7)
   deleted: (at person7 city7)
   added: (in person7 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 4 of 7
18. (refuel plane3 city7)
   changed: (fuel plane3) from 1679 to 6455
   goals met: 4 of 7
19. (fly plane3 city7 city3)
   deleted: (at plane3 city7)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 10581 to 13086, (fuel plane3) from 6455 to 3950
   goals met: 4 of 7
20. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   changed: (onboard plane3) from 3 to 2
   goals met: 5 of 7
21. (debark person7 plane3 city3)
   deleted: (in person7 plane3)
   added: (at person7 city3)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 7
22. (fly plane3 city3 city8)
   deleted: (at plane3 city3)
   added: (at plane3 city8)
   changed: (total-fuel-used) from 13086 to 15696, (fuel plane3) from 3950 to 1340
   goals met: 6 of 7
23. (debark person5 plane3 city8)
   deleted: (in person5 plane3)
   added: (at person5 city8)
   changed: (onboard plane3) from 1 to 0
   goals met: 7 of 7
